espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_syscfg.h
/* Bit fields for SYSCFG RADIORAMRETNCTRL */
#define _SYSCFG_RADIORAMRETNCTRL_RESETVALUE                0x00000000UL                                            /**< Default value for SYSCFG_RADIORAMRETNCTRL   */
#define _SYSCFG_RADIORAMRETNCTRL_MASK                      0xF33FF107UL                                            /**< Mask for SYSCFG_RADIORAMRETNCTRL            */
#define _SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_SHIFT      0                                                       /**< Shift value for SYSCFG_SEQRAMRETNCTRL       */
#define _SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_MASK       0x7UL                                                   /**< Bit mask for SYSCFG_SEQRAMRETNCTRL          */
#define _SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_DEFAULT    0x00000000UL                                            /**< Mode DEFAULT for SYSCFG_RADIORAMRETNCTRL    */
#define _SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_ALLON      0x00000000UL                                            /**< Mode ALLON for SYSCFG_RADIORAMRETNCTRL      */
#define _SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_BLK0       0x00000001UL                                            /**< Mode BLK0 for SYSCFG_RADIORAMRETNCTRL       */
#define _SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_BLK1       0x00000002UL                                            /**< Mode BLK1 for SYSCFG_RADIORAMRETNCTRL       */
#define _SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_BLK2       0x00000004UL                                            /**< Mode BLK2 for SYSCFG_RADIORAMRETNCTRL       */
#define _SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_BLK1TO2    0x00000006UL                                            /**< Mode BLK1TO2 for SYSCFG_RADIORAMRETNCTRL    */
#define _SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_ALLOFF     0x00000007UL                                            /**< Mode ALLOFF for SYSCFG_RADIORAMRETNCTRL     */
#define SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_DEFAULT     (_SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_DEFAULT << 0)  /**< Shifted mode DEFAULT for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_ALLON       (_SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_ALLON << 0)    /**< Shifted mode ALLON for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_BLK0        (_SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_BLK0 << 0)     /**< Shifted mode BLK0 for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_BLK1        (_SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_BLK1 << 0)     /**< Shifted mode BLK1 for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_BLK2        (_SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_BLK2 << 0)     /**< Shifted mode BLK2 for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_BLK1TO2     (_SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_BLK1TO2 << 0)  /**< Shifted mode BLK1TO2 for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_ALLOFF      (_SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_ALLOFF << 0)   /**< Shifted mode ALLOFF for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL             (0x1UL << 8)                                            /**< FRCRAM Retention Control                    */
#define _SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_SHIFT      8                                                       /**< Shift value for SYSCFG_FRCRAMRETNCTRL       */
#define _SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_MASK       0x100UL                                                 /**< Bit mask for SYSCFG_FRCRAMRETNCTRL          */
#define _SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_DEFAULT    0x00000000UL                                            /**< Mode DEFAULT for SYSCFG_RADIORAMRETNCTRL    */
#define _SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_ALLON      0x00000000UL                                            /**< Mode ALLON for SYSCFG_RADIORAMRETNCTRL      */
#define _SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_ALLOFF     0x00000001UL                                            /**< Mode ALLOFF for SYSCFG_RADIORAMRETNCTRL     */
#define SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_DEFAULT     (_SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_DEFAULT << 8)  /**< Shifted mode DEFAULT for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_ALLON       (_SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_ALLON << 8)    /**< Shifted mode ALLON for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_ALLOFF      (_SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_ALLOFF << 8)   /**< Shifted mode ALLOFF for SYSCFG_RADIORAMRETNCTRL*/
#define _SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_SHIFT      12                                                      /**< Shift value for SYSCFG_ITCRAMRETNCTRL       */
#define _SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_MASK       0x3FF000UL                                              /**< Bit mask for SYSCFG_ITCRAMRETNCTRL          */
#define _SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_DEFAULT    0x00000000UL                                            /**< Mode DEFAULT for SYSCFG_RADIORAMRETNCTRL    */
#define _SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_ALLON      0x00000000UL                                            /**< Mode ALLON for SYSCFG_RADIORAMRETNCTRL      */
#define _SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK9       0x00000200UL                                            /**< Mode BLK9 for SYSCFG_RADIORAMRETNCTRL       */
#define _SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK8TO9    0x00000300UL                                            /**< Mode BLK8TO9 for SYSCFG_RADIORAMRETNCTRL    */
#define _SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK7TO9    0x00000380UL                                            /**< Mode BLK7TO9 for SYSCFG_RADIORAMRETNCTRL    */
#define _SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK6TO9    0x000003C0UL                                            /**< Mode BLK6TO9 for SYSCFG_RADIORAMRETNCTRL    */
#define _SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK5TO9    0x000003E0UL                                            /**< Mode BLK5TO9 for SYSCFG_RADIORAMRETNCTRL    */
#define _SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK4TO9    0x000003F0UL                                            /**< Mode BLK4TO9 for SYSCFG_RADIORAMRETNCTRL    */
#define _SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK3TO9    0x000003F8UL                                            /**< Mode BLK3TO9 for SYSCFG_RADIORAMRETNCTRL    */
#define _SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK2TO9    0x000003FCUL                                            /**< Mode BLK2TO9 for SYSCFG_RADIORAMRETNCTRL    */
#define _SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK1TO9    0x000003FEUL                                            /**< Mode BLK1TO9 for SYSCFG_RADIORAMRETNCTRL    */
#define _SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_ALLOFF     0x000003FFUL                                            /**< Mode ALLOFF for SYSCFG_RADIORAMRETNCTRL     */
#define SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_DEFAULT     (_SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_DEFAULT << 12) /**< Shifted mode DEFAULT for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_ALLON       (_SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_ALLON << 12)   /**< Shifted mode ALLON for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK9        (_SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK9 << 12)    /**< Shifted mode BLK9 for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK8TO9     (_SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK8TO9 << 12) /**< Shifted mode BLK8TO9 for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK7TO9     (_SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK7TO9 << 12) /**< Shifted mode BLK7TO9 for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK6TO9     (_SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK6TO9 << 12) /**< Shifted mode BLK6TO9 for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK5TO9     (_SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK5TO9 << 12) /**< Shifted mode BLK5TO9 for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK4TO9     (_SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK4TO9 << 12) /**< Shifted mode BLK4TO9 for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK3TO9     (_SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK3TO9 << 12) /**< Shifted mode BLK3TO9 for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK2TO9     (_SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK2TO9 << 12) /**< Shifted mode BLK2TO9 for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK1TO9     (_SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_BLK1TO9 << 12) /**< Shifted mode BLK1TO9 for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_ALLOFF      (_SYSCFG_RADIORAMRETNCTRL_ITCRAMRETNCTRL_ALLOFF << 12)  /**< Shifted mode ALLOFF for SYSCFG_RADIORAMRETNCTRL*/
#define _SYSCFG_RADIORAMRETNCTRL_DTCRAMRETNCTRL_SHIFT      24                                                      /**< Shift value for SYSCFG_DTCRAMRETNCTRL       */
#define _SYSCFG_RADIORAMRETNCTRL_DTCRAMRETNCTRL_MASK       0x3000000UL                                             /**< Bit mask for SYSCFG_DTCRAMRETNCTRL          */
#define _SYSCFG_RADIORAMRETNCTRL_DTCRAMRETNCTRL_DEFAULT    0x00000000UL                                            /**< Mode DEFAULT for SYSCFG_RADIORAMRETNCTRL    */
#define _SYSCFG_RADIORAMRETNCTRL_DTCRAMRETNCTRL_ALLON      0x00000000UL                                            /**< Mode ALLON for SYSCFG_RADIORAMRETNCTRL      */
#define _SYSCFG_RADIORAMRETNCTRL_DTCRAMRETNCTRL_BLK1       0x00000002UL                                            /**< Mode BLK1 for SYSCFG_RADIORAMRETNCTRL       */
#define _SYSCFG_RADIORAMRETNCTRL_DTCRAMRETNCTRL_ALLOFF     0x00000003UL                                            /**< Mode ALLOFF for SYSCFG_RADIORAMRETNCTRL     */
#define SYSCFG_RADIORAMRETNCTRL_DTCRAMRETNCTRL_DEFAULT     (_SYSCFG_RADIORAMRETNCTRL_DTCRAMRETNCTRL_DEFAULT << 24) /**< Shifted mode DEFAULT for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_DTCRAMRETNCTRL_ALLON       (_SYSCFG_RADIORAMRETNCTRL_DTCRAMRETNCTRL_ALLON << 24)   /**< Shifted mode ALLON for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_DTCRAMRETNCTRL_BLK1        (_SYSCFG_RADIORAMRETNCTRL_DTCRAMRETNCTRL_BLK1 << 24)    /**< Shifted mode BLK1 for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_DTCRAMRETNCTRL_ALLOFF      (_SYSCFG_RADIORAMRETNCTRL_DTCRAMRETNCTRL_ALLOFF << 24)  /**< Shifted mode ALLOFF for SYSCFG_RADIORAMRETNCTRL*/
#define _SYSCFG_RADIORAMRETNCTRL_AHBRAMRETNCTRL_SHIFT      28                                                      /**< Shift value for SYSCFG_AHBRAMRETNCTRL       */
#define _SYSCFG_RADIORAMRETNCTRL_AHBRAMRETNCTRL_MASK       0xF0000000UL                                            /**< Bit mask for SYSCFG_AHBRAMRETNCTRL          */
#define _SYSCFG_RADIORAMRETNCTRL_AHBRAMRETNCTRL_DEFAULT    0x00000000UL                                            /**< Mode DEFAULT for SYSCFG_RADIORAMRETNCTRL    */
#define _SYSCFG_RADIORAMRETNCTRL_AHBRAMRETNCTRL_ALLON      0x00000000UL                                            /**< Mode ALLON for SYSCFG_RADIORAMRETNCTRL      */
#define _SYSCFG_RADIORAMRETNCTRL_AHBRAMRETNCTRL_BLK3       0x00000008UL                                            /**< Mode BLK3 for SYSCFG_RADIORAMRETNCTRL       */
#define _SYSCFG_RADIORAMRETNCTRL_AHBRAMRETNCTRL_BLK2TO3    0x0000000CUL                                            /**< Mode BLK2TO3 for SYSCFG_RADIORAMRETNCTRL    */
#define _SYSCFG_RADIORAMRETNCTRL_AHBRAMRETNCTRL_BLK1TO3    0x0000000EUL                                            /**< Mode BLK1TO3 for SYSCFG_RADIORAMRETNCTRL    */
#define _SYSCFG_RADIORAMRETNCTRL_AHBRAMRETNCTRL_ALLOFF     0x0000000FUL                                            /**< Mode ALLOFF for SYSCFG_RADIORAMRETNCTRL     */
#define SYSCFG_RADIORAMRETNCTRL_AHBRAMRETNCTRL_DEFAULT     (_SYSCFG_RADIORAMRETNCTRL_AHBRAMRETNCTRL_DEFAULT << 28) /**< Shifted mode DEFAULT for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_AHBRAMRETNCTRL_ALLON       (_SYSCFG_RADIORAMRETNCTRL_AHBRAMRETNCTRL_ALLON << 28)   /**< Shifted mode ALLON for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_AHBRAMRETNCTRL_BLK3        (_SYSCFG_RADIORAMRETNCTRL_AHBRAMRETNCTRL_BLK3 << 28)    /**< Shifted mode BLK3 for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_AHBRAMRETNCTRL_BLK2TO3     (_SYSCFG_RADIORAMRETNCTRL_AHBRAMRETNCTRL_BLK2TO3 << 28) /**< Shifted mode BLK2TO3 for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_AHBRAMRETNCTRL_BLK1TO3     (_SYSCFG_RADIORAMRETNCTRL_AHBRAMRETNCTRL_BLK1TO3 << 28) /**< Shifted mode BLK1TO3 for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_AHBRAMRETNCTRL_ALLOFF      (_SYSCFG_RADIORAMRETNCTRL_AHBRAMRETNCTRL_ALLOFF << 28)  /**< Shifted mode ALLOFF for SYSCFG_RADIORAMRETNCTRL*/

