espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_syscfg.h
/* Bit fields for SYSCFG ROOTNSDATA0 */
#define _SYSCFG_ROOTNSDATA0_RESETVALUE                    0x00000000UL                            /**< Default value for SYSCFG_ROOTNSDATA0        */
#define _SYSCFG_ROOTNSDATA0_MASK                          0xFFFFFFFFUL                            /**< Mask for SYSCFG_ROOTNSDATA0                 */
#define _SYSCFG_ROOTNSDATA0_DATA_SHIFT                    0                                       /**< Shift value for SYSCFG_DATA                 */
#define _SYSCFG_ROOTNSDATA0_DATA_MASK                     0xFFFFFFFFUL                            /**< Bit mask for SYSCFG_DATA                    */
#define _SYSCFG_ROOTNSDATA0_DATA_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for SYSCFG_ROOTNSDATA0         */
#define SYSCFG_ROOTNSDATA0_DATA_DEFAULT                   (_SYSCFG_ROOTNSDATA0_DATA_DEFAULT << 0) /**< Shifted mode DEFAULT for SYSCFG_ROOTNSDATA0 */

/* Bit fields for SYSCFG ROOTNSDATA1 */
#define _SYSCFG_ROOTNSDATA1_RESETVALUE                    0x00000000UL                            /**< Default value for SYSCFG_ROOTNSDATA1        */
#define _SYSCFG_ROOTNSDATA1_MASK                          0xFFFFFFFFUL                            /**< Mask for SYSCFG_ROOTNSDATA1                 */
#define _SYSCFG_ROOTNSDATA1_DATA_SHIFT                    0                                       /**< Shift value for SYSCFG_DATA                 */
#define _SYSCFG_ROOTNSDATA1_DATA_MASK                     0xFFFFFFFFUL                            /**< Bit mask for SYSCFG_DATA                    */
#define _SYSCFG_ROOTNSDATA1_DATA_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for SYSCFG_ROOTNSDATA1         */
#define SYSCFG_ROOTNSDATA1_DATA_DEFAULT                   (_SYSCFG_ROOTNSDATA1_DATA_DEFAULT << 0) /**< Shifted mode DEFAULT for SYSCFG_ROOTNSDATA1 */

/* Bit fields for SYSCFG CFGNSRPURATD0 */
#define _SYSCFG_CFGNSRPURATD0_RESETVALUE                  0x00000000UL                                         /**< Default value for SYSCFG_CFGNSRPURATD0      */
#define _SYSCFG_CFGNSRPURATD0_MASK                        0x00000180UL                                         /**< Mask for SYSCFG_CFGNSRPURATD0               */
#define SYSCFG_CFGNSRPURATD0_RATDCFGNSTCALIB              (0x1UL << 7)                                         /**< CFGNSTCALIB Protection Bit                  */
#define _SYSCFG_CFGNSRPURATD0_RATDCFGNSTCALIB_SHIFT       7                                                    /**< Shift value for SYSCFG_RATDCFGNSTCALIB      */
#define _SYSCFG_CFGNSRPURATD0_RATDCFGNSTCALIB_MASK        0x80UL                                               /**< Bit mask for SYSCFG_RATDCFGNSTCALIB         */
#define _SYSCFG_CFGNSRPURATD0_RATDCFGNSTCALIB_DEFAULT     0x00000000UL                                         /**< Mode DEFAULT for SYSCFG_CFGNSRPURATD0       */
#define SYSCFG_CFGNSRPURATD0_RATDCFGNSTCALIB_DEFAULT      (_SYSCFG_CFGNSRPURATD0_RATDCFGNSTCALIB_DEFAULT << 7) /**< Shifted mode DEFAULT for SYSCFG_CFGNSRPURATD0*/
#define SYSCFG_CFGNSRPURATD0_RATDCFGNSSYSTIC              (0x1UL << 8)                                         /**< CFGNSSYSTIC Protection Bit                  */
#define _SYSCFG_CFGNSRPURATD0_RATDCFGNSSYSTIC_SHIFT       8                                                    /**< Shift value for SYSCFG_RATDCFGNSSYSTIC      */
#define _SYSCFG_CFGNSRPURATD0_RATDCFGNSSYSTIC_MASK        0x100UL                                              /**< Bit mask for SYSCFG_RATDCFGNSSYSTIC         */
#define _SYSCFG_CFGNSRPURATD0_RATDCFGNSSYSTIC_DEFAULT     0x00000000UL                                         /**< Mode DEFAULT for SYSCFG_CFGNSRPURATD0       */
#define SYSCFG_CFGNSRPURATD0_RATDCFGNSSYSTIC_DEFAULT      (_SYSCFG_CFGNSRPURATD0_RATDCFGNSSYSTIC_DEFAULT << 8) /**< Shifted mode DEFAULT for SYSCFG_CFGNSRPURATD0*/

/* Bit fields for SYSCFG CFGNSRPURATD12 */
#define _SYSCFG_CFGNSRPURATD12_RESETVALUE                 0x00000000UL                                          /**< Default value for SYSCFG_CFGNSRPURATD12     */
#define _SYSCFG_CFGNSRPURATD12_MASK                       0x00000003UL                                          /**< Mask for SYSCFG_CFGNSRPURATD12              */
#define SYSCFG_CFGNSRPURATD12_RATDROOTNSDATA0             (0x1UL << 0)                                          /**< DATA0 Protection Bit                        */
#define _SYSCFG_CFGNSRPURATD12_RATDROOTNSDATA0_SHIFT      0                                                     /**< Shift value for SYSCFG_RATDROOTNSDATA0      */
#define _SYSCFG_CFGNSRPURATD12_RATDROOTNSDATA0_MASK       0x1UL                                                 /**< Bit mask for SYSCFG_RATDROOTNSDATA0         */
#define _SYSCFG_CFGNSRPURATD12_RATDROOTNSDATA0_DEFAULT    0x00000000UL                                          /**< Mode DEFAULT for SYSCFG_CFGNSRPURATD12      */
#define SYSCFG_CFGNSRPURATD12_RATDROOTNSDATA0_DEFAULT     (_SYSCFG_CFGNSRPURATD12_RATDROOTNSDATA0_DEFAULT << 0) /**< Shifted mode DEFAULT for SYSCFG_CFGNSRPURATD12*/
#define SYSCFG_CFGNSRPURATD12_RATDROOTNSDATA1             (0x1UL << 1)                                          /**< DATA1 Protection Bit                        */
#define _SYSCFG_CFGNSRPURATD12_RATDROOTNSDATA1_SHIFT      1                                                     /**< Shift value for SYSCFG_RATDROOTNSDATA1      */
#define _SYSCFG_CFGNSRPURATD12_RATDROOTNSDATA1_MASK       0x2UL                                                 /**< Bit mask for SYSCFG_RATDROOTNSDATA1         */
#define _SYSCFG_CFGNSRPURATD12_RATDROOTNSDATA1_DEFAULT    0x00000000UL                                          /**< Mode DEFAULT for SYSCFG_CFGNSRPURATD12      */
#define SYSCFG_CFGNSRPURATD12_RATDROOTNSDATA1_DEFAULT     (_SYSCFG_CFGNSRPURATD12_RATDROOTNSDATA1_DEFAULT << 1) /**< Shifted mode DEFAULT for SYSCFG_CFGNSRPURATD12*/

/** @} End of group EFR32FG25_SYSCFG_CFGNS_BitFields */
/** @} End of group EFR32FG25_SYSCFG_CFGNS */
/** @} End of group Parts */

#endif /* EFR32FG25_SYSCFG_H */
